dreamted/TRIO_MR_MD/2.TRIO-MR/appl_stm207_20141204_RvsALC_20151223/STM32F2xx_StdPeriph_Driver_v1212/inc/stm32f0xx_core.h
/**************************************************************************//**
 * @file     core_cm3.h
 * @brief    CMSIS Cortex-M3 Core Peripheral Access Layer Header File
 * @version  V1.30
 * @date     30. October 2009
 *
 * @note
 * Copyright (C) 2009 ARM Limited. All rights reserved.
 *
 * @par
 * ARM Limited (ARM) is supplying this software for use with Cortex-M 
 * processor based microcontrollers.  This file can be freely distributed 
 * within development tools that are supporting such ARM based processors. 
 *
 * @par
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * ARM SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR
 * CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 ******************************************************************************/

#ifndef __CM3_CORE_H__
#define __CM3_CORE_H__

/** @addtogroup CMSIS_CM3_core_LintCinfiguration CMSIS CM3 Core Lint Configuration
 *
 * List of Lint messages which will be suppressed and not shown:
 *   - Error 10: \n
 *     register uint32_t __regBasePri         __asm("basepri"); \n
 *     Error 10: Expecting ';'
 * .
 *   - Error 530: \n
 *     return(__regBasePri); \n
 *     Warning 530: Symbol '__regBasePri' (line 264) not initialized
 * . 
 *   - Error 550: \n
 *     __regBasePri = (basePri & 0x1ff); \n
 *     Warning 550: Symbol '__regBasePri' (line 271) not accessed
 * .
 *   - Error 754: \n
 *     uint32_t RESERVED0[24]; \n
 *     Info 754: local structure member '<some, not used in the HAL>' (line 109, file ./cm3_core.h) not referenced
 * .
 *   - Error 750: \n
 *     #define __CM3_CORE_H__ \n
 *     Info 750: local macro '__CM3_CORE_H__' (line 43, file./cm3_core.h) not referenced
 * .
 *   - Error 528: \n
 *     static __INLINE void NVIC_DisableIRQ(uint32_t IRQn) \n
 *     Warning 528: Symbol 'NVIC_DisableIRQ(unsigned int)' (line 419, file ./cm3_core.h) not referenced
 * .
 *   - Error 751: \n
 *     } InterruptType_Type; \n
 *     Info 751: local typedef 'InterruptType_Type' (line 170, file ./cm3_core.h) not referenced
 * .
 * Note:  To re-enable a Message, insert a space before 'lint' *
 *
 */

/*lint -save */
/*lint -e10  */
/*lint -e530 */
/*lint -e550 */
/*lint -e754 */
/*lint -e750 */
/*lint -e528 */
/*lint -e751 */


/** @addtogroup CMSIS_CM3_core_definitions CM3 Core Definitions
  This file defines all structures and symbols for CMSIS core:
    - CMSIS version number
    - Cortex-M core registers and bitfields
    - Cortex-M core peripheral base address
  @{
 */

#ifdef __cplusplus
 extern "C" {
#endif 

#define __CM3_CMSIS_VERSION_MAIN  (0x01)                                                       /*!< [31:16] CMSIS HAL main version */
#define __CM3_CMSIS_VERSION_SUB   (0x30)                                                       /*!< [15:0]  CMSIS HAL sub version  */
#define __CM3_CMSIS_VERSION       ((__CM3_CMSIS_VERSION_MAIN << 16) | __CM3_CMSIS_VERSION_SUB) /*!< CMSIS HAL version number       */

#define __CORTEX_M                (0x03)                                                       /*!< Cortex core                    */

#if defined (__ICCARM__)
#endif


#ifndef __NVIC_PRIO_BITS
  #define __NVIC_PRIO_BITS    4               /*!< standard definition for NVIC Priority Bits */
#endif




/*******************************************************************************
 * IO definitions
 *
 * define access restrictions to peripheral registers
 ******************************************************************************/

#ifdef __cplusplus
	#define     __I     volatile			/*!< defines 'read only' permissions      */
#else
	#define     __I     volatile const      /*!< defines 'read only' permissions      */
#endif
#define     __O     volatile                /*!< defines 'write only' permissions     */
#define     __IO    volatile				/*!< defines 'read / write' permissions   */

/*******************************************************************************
 *                 Register Abstraction
 ******************************************************************************/
/** @addtogroup CMSIS_CM3_core_register CMSIS CM3 Core Register
 @{
*/


/** @addtogroup CMSIS_CM3_NVIC CMSIS CM3 NVIC
  memory mapped structure for Nested Vectored Interrupt Controller (NVIC)
  @{
 */
typedef union{
	struct {
		__IO uint32_t ISER[8];                      /*!< Offset: 0x000  Interrupt Set Enable Register           (0~239)*/
		   uint32_t RESERVED0[24];                                   
		__IO uint32_t ICER[8];                      /*!< Offset: 0x080  Interrupt Clear Enable Register         */
		   uint32_t RSERVED1[24];                                    
		__IO uint32_t ISPR[8];                      /*!< Offset: 0x100  Interrupt Set Pending Register          */
		   uint32_t RESERVED2[24];                                   
		__IO uint32_t ICPR[8];                      /*!< Offset: 0x180  Interrupt Clear Pending Register        */
		   uint32_t RESERVED3[24];                                   
		__IO uint32_t IABR[8];                      /*!< Offset: 0x200  Interrupt Active bit Register           */
		   uint32_t RESERVED4[56];                                   
		__IO uint8_t  IP[240];                      /*!< Offset: 0x300  Interrupt Priority Register (8Bit wide) */
		   uint32_t RESERVED5[644];                                  
		__O  uint32_t STIR;                         /*!< Offset: 0xE00  Software Trigger Interrupt Register     */
	};
	struct {
		__IO uint16_t ISER[16];                      /*!< Offset: 0x000  Interrupt Set Enable Register           (0~239)*/
		   uint32_t RESERVED0[24];                                   

		__IO uint16_t ICER[16];                     /*!< Offset: 0x080  Interrupt Clear Enable Register         */
		   uint32_t RSERVED1[24];                                    

		__IO uint32_t ISPR[8];                      /*!< Offset: 0x100  Interrupt Set Pending Register          */
		   uint32_t RESERVED2[24];                                   

		__IO uint32_t ICPR[16];                     /*!< Offset: 0x180  Interrupt Clear Pending Register        */
		   uint32_t RESERVED3[24];                                   

		__IO uint32_t IABR[8];                      /*!< Offset: 0x200  Interrupt Active bit Register           */
		   uint32_t RESERVED4[56];                                   

		__IO uint8_t  IP[240];                      /*!< Offset: 0x300  Interrupt Priority Register (8Bit wide) */
		   uint32_t RESERVED5[644];                                  
		__O  uint32_t STIR;                         /*!< Offset: 0xE00  Software Trigger Interrupt Register     */
	} __B;
}  NVIC_Type;
/*@}*/ /* end of group CMSIS_CM3_NVIC */


