dreamted/TRIO_MR_MD/2.TRIO-MR/appl_stm207_20141204_RvsALC_20151223/STM32F2xx_StdPeriph_Driver_v1212/inc/stm32f0xx_core.h
/** @addtogroup CMSIS_CM3_SCB CMSIS CM3 SCB
  memory mapped structure for System Control Block (SCB)
  @{
 */
typedef union
{
	struct {
		__I  uint32_t CPUID;                        /*!< Offset: 0x00  CPU ID Base Register                                  */
		__IO uint32_t ICSR;                         /*!< Offset: 0x04  Interrupt Control State Register                      */
		__IO uint32_t VTOR;                         /*!< Offset: 0x08  Vector Table Offset Register                          */
		__IO uint32_t AIRCR;                        /*!< Offset: 0x0C  Application Interrupt / Reset Control Register        */
		__IO uint32_t SCR;                          /*!< Offset: 0x10  System Control Register                               */
		__IO uint32_t CCR;                          /*!< Offset: 0x14  Configuration Control Register                        */
		__IO uint8_t  SHP[12];                      /*!< Offset: 0x18  System Handlers Priority Registers (4-7, 8-11, 12-15) */
		__IO uint32_t SHCSR;                        /*!< Offset: 0x24  System Handler Control and State Register             */
		__IO uint32_t CFSR;                         /*!< Offset: 0x28  Configurable Fault Status Register                    */
		__IO uint32_t HFSR;                         /*!< Offset: 0x2C  Hard Fault Status Register                            */
		__IO uint32_t DFSR;                         /*!< Offset: 0x30  Debug Fault Status Register                           */
		__IO uint32_t MMFAR;                        /*!< Offset: 0x34  Mem Manage Address Register                           */
		__IO uint32_t BFAR;                         /*!< Offset: 0x38  Bus Fault Address Register                            */
		__IO uint32_t AFSR;                         /*!< Offset: 0x3C  Auxiliary Fault Status Register                       */
		__I  uint32_t PFR[2];                       /*!< Offset: 0x40  Processor Feature Register                            */
		__I  uint32_t DFR;                          /*!< Offset: 0x48  Debug Feature Register                                */
		__I  uint32_t ADR;                          /*!< Offset: 0x4C  Auxiliary Feature Register                            */
		__I  uint32_t MMFR[4];                      /*!< Offset: 0x50  Memory Model Feature Register                         */
		__I  uint32_t ISAR[5];                      /*!< Offset: 0x60  ISA Feature Register                                  */
	};
	struct {
		union {
			vu32 Data;
			struct {
				vu32 REVISION		:4;				/*!< Implementation defined revision number */
				vu32 PARTNO			:12;			/*!< Number of processor within family */
				
				vu32				:4;
				vu32 VARIANT		:4;				/*!< Implementation defined variant number. */
				vu32 IMPLEMENTER	:8;				/*!< Implementer code. ARM is 0x41 */
			};
		} CPUID;									/*!< Offset: 0x00  CPU ID Base Register                                  */
		// 0
		union {
			vu32 Data;
			struct {
				vu32 VECTACTIVE		:9;				/*!< Active ISR number field */
				vu32				:2;
				vu32 RETTOBASE		:1;				/*!< This bit is 1 when the set of all active exceptions minus
														IPSR_current_exception yields the empty set. */
				vu32 VECTPENDING	:10;			/*!< Pending ISR number field. */

				vu32 ISRPENDING		:1;				/*!< Interrupt pending flag. Excludes NMI and Faults */
				vu32 ISRPREEMPT		:1;				/*!< You must only use this at debug time */
				vu32				:1;
				vu32 PENDSTCLR		:1;				/*!< Clear pending SysTick bit */
				vu32 PENDSTSET		:1;				/*!< Set a pending SysTick bit */
				vu32 PENDSVCLR		:1;				/*!< Clear pending pendSV */
				vu32 PENDSVSET		:1;				/*!< Set pending pendSV bit */
				vu32				:2;
				vu32 NMIPENDSET		:1;			 /*!< Set pending NMI bit */
			};
		} ICSR;			                         /*!< Offset: 0x04  Interrupt Control State Register                      */

		union {
			vu32 Data;
			struct {
				vu32				:7;
				vu32 TBLOFF			:12;		/*! < Vector table base offset field. */
				vu32 TBLBASE		:1;			/*! < Table base is in Code (0) or RAM (1) */
			};
		} VTOR;                         		/*!< Offset: 0x08  Vector Table Offset Register                          */
		union {
			vu32 Data;
			struct {
				vu32 VECTRESET		:1; 	// System Reset Bit(with the exception of debug component)
				vu32 VECTCLRACTIVE	:1; 	// Clear active vector bit
				vu32 SYSRESETREQ	:1; 	// reset(outer)
				vu32				:4;
				vu32 PRIGROUP		:4; 	// Interrupt priority grouping field
				vu32				:4; 	//
				vu32 ENDIANESS		:1; 	// Data Endianness bit(1: big endian, 0: little endian)
				vu32 VECTKEY		:16;	// register key(SET: 0x5FA, READ: 0xFA05)
			};
		} AIRCR;								/*!< Offset: 0x0C  Application Interrupt / Reset Control Register        */

		union {
			vu32 Data;
			struct {
				vu32				:1;
				vu32 SLEEPONEXIT	:1;			/*!< Sleep on exit when returning from Handler mode to Thread mode		*/
				vu32 SLEEPDEEP		:1;			/*!< Sleep deep bit */
				vu32				:1;
				vu32 SEVONPEND		:1;			/*! <When enabled, this causes WFE to wake up when an interrupt moves from inactive to
													pended. Otherwise, WFE only wakes up from an event signal, external and SEV instruction
													generated. The event input, RXEV, is registered even when not waiting for an event, and so
													effects the next WFE. */
			};
		} SCR;		                     	    /*!< Offset: 0x10  System Control Register                               */

		union {
			vu32 Data;
			struct {
				vu32 NONEBASETHRDENA:1;
				vu32 USERSETMPEND	:1;
				vu32				:1;
				vu32 UNALIGN_TRP	:1;			/*!< Trap for unaligned access */
				vu32 DIV_0_TRP		:1;			/*!< Trap on Divide by 0 */
				vu32				:3;
				vu32 BFHFNMIGN		:1;
				vu32 STKALIGN		:1;			/*!< 1 = on exception entry */
			};
		} CCR;                          		/*!< Offset: 0x14  Configuration Control Register                        */
		vu32 SHP[3];                      		/*!< Offset: 0x18  System Handlers Priority Registers (4-7, 8-11, 12-15) */
		vu32 SHCSR;                    			/*!< Offset: 0x24  System Handler Control and State Register             */
		vu32 CFSR;                         		/*!< Offset: 0x28  Configurable Fault Status Register                    */
		vu32 HFSR;				                /*!< Offset: 0x2C  Hard Fault Status Register                            */
		vu32 DFSR;		                        /*!< Offset: 0x30  Debug Fault Status Register                           */
		vu32 MMFAR;                        		/*!< Offset: 0x34  Mem Manage Address Register                           */
		vu32 BFAR;                         		/*!< Offset: 0x38  Bus Fault Address Register                            */
		vu32 AFSR;                         		/*!< Offset: 0x3C  Auxiliary Fault Status Register                       */
		vuc32 PFR[2];                      		/*!< Offset: 0x40  Processor Feature Register                            */
		vuc32 DFR;                          	/*!< Offset: 0x48  Debug Feature Register                                */
		vuc32 ADR;                          	/*!< Offset: 0x4C  Auxiliary Feature Register                            */
		vuc32 MMFR[4];                      	/*!< Offset: 0x50  Memory Model Feature Register                         */
		vuc32 ISAR[5];                      	/*!< Offset: 0x60  ISA Feature Register                                  */

	} __B;
} SCB_Type;                                                


/* SCB CPUID Register Definitions */
#define SCB_CPUID_IMPLEMENTER_Pos          24                                             /*!< SCB CPUID: IMPLEMENTER Position */
#define SCB_CPUID_IMPLEMENTER_Msk          (0xFFul << SCB_CPUID_IMPLEMENTER_Pos)          /*!< SCB CPUID: IMPLEMENTER Mask */

#define SCB_CPUID_VARIANT_Pos              20                                             /*!< SCB CPUID: VARIANT Position */
#define SCB_CPUID_VARIANT_Msk              (0xFul << SCB_CPUID_VARIANT_Pos)               /*!< SCB CPUID: VARIANT Mask */

